* Summer HW
** Algebra II [100%]
*** DONE Aleks: <2021-09-09 Thu>
1. [X] Log into ALEKS
2. [X] Leave Geometry Class
3. [X] Complete Pretest
4. [X] Complete at least an 80% mastery rating on the topic
**** Counts as a project grade
**** Code: JCYLL-EHXK4
**** rdally@jcboe.org for issues
*** Link: https://drive.google.com/file/d/1e1bWj4ZUs8ZcnIBW3vRMDMqGXMOPECvA/view

** AP Chem [100%]
*** Resources
Textbook: Chemistry, The Molecular Nature of Matter and Change, 7 th ed., by Silberberg and Amateis.
Review Book: Peterson’s AP Chemistry by Brett Barker.
*** Quiz
Memorize the table of common ions, strong acids, bases, and diatomic elements. Reference documents are on Google Classroom
*** 3 Part Assignment
1. Each assignment counts as a quiz grade
2. Write all math work
3. Include Units
**** DONE AP Chem Assignment 1 <2021-07-16 Fri>
Pages 2-4
**** DONE AP Chem Assignment 2 <2021-08-06 Fri>
CLOSED: [2021-08-19 Thu 13:46]
Pages 5-8
**** DONE AP Chem Assignment 3 <2021-08-27 Fri>
Pages 8-15
*** Link: https://drive.google.com/file/d/15JhR1OkjivA5K3aASK7XAIeSh05AAdiH/view?usp=drive_web&authuser=0

** AP Sem [100%] <2021-09-09 Thu>
*** DONE Choose a theme,
*** DONE Come up with possible questions for each lens.
CLOSED: [2021-08-19 Thu 13:46]
*** DONE Find an article which supports the question you want to explore. Use the table below.
CLOSED: [2021-08-19 Thu 13:46]
*** DONE Journal 1
*** DONE Journal 2
*** Link: https://docs.google.com/document/d/1AgheICzyVXinpNIlrc68NYpcnj3ixJpsZE4_Ji8mN5M/edit

** AP CSP [100%]
*** DONE Reading <2021-09-09 Thu>
Read chapters 1-6 of the book: Blown to Bits: Your Life, Liberty, and Happiness After the Digital Explosion by Hal Abelson, Ken Ledeem and Harry Lewis.
Book is available at http://www.bitsbook.com/excerpts/.
**** Create a vocabulary list and a journal entry for each chapter.
Vocabulary list should have a minimum of 10 words with their definitions and corresponding citation using the MLA format.
**** Journal Entry
1. Write down four Ideas
2. Critical for the chapter, page number should be included
3. Complete a double entry journal explaining your opinion on those ideas, two paragraphs minimum.
*** DONE Khan Academy <2021-08-31 Tue>
CLOSED: [2021-08-07 Sat 15:35]
**** Complete the assignment On Khanacademy
**** Code: TN2B2XJS
*** Link: https://drive.google.com/file/d/1cxUppiGJmv22fipQfyjXtoKX0wrBUBG-/view?usp=drive_web&authuser=0

* Week 1
** Thursday
*** Bio
**** DONE Checkout textbook
CLOSED: [2021-09-09 Thu 17:26]
**** DONE Getting to know sheet
CLOSED: [2021-09-11 Sat 13:57]
**** DONE Notebook + folder
CLOSED: [2021-09-11 Sat 13:56]
*** Sem
**** DONE Laptop + folder
CLOSED: [2021-09-11 Sat 13:56]
*** CSP
**** DONE Laptop + folder
CLOSED: [2021-09-11 Sat 13:56]
*** Spanish
**** DONE Notebook + folder
CLOSED: [2021-09-11 Sat 13:56]
*** Algebra 2
**** DONE Notebook + graph paper in binder
CLOSED: [2021-09-11 Sat 13:57]
*** USH 2
**** DONE Notebook + folder

** Friday
*** Bio [100%]
**** DONE Bring Home and Cover textbook   <2021-09-13 Mon>
CLOSED: [2021-09-11 Sat 15:10]
**** DONE Get to know you worksheet <2021-09-10 Fri>
CLOSED: [2021-09-11 Sat 14:09]
**** DONE [[https://classroom.google.com/u/1/c/Mzg2ODE5MzE1NTE0/a/MzIwNjU4NjYyODE4/details][Safety Rules]] <2021-09-13 Mon>
CLOSED: [2021-09-12 Sun 23:03]
*** Sem [0%]
**** DONE Make questions more descriptive (summer hw) <2021-09-17 Fri>
*** Chem [50%]
**** DONE Join College Board class <2021-09-10 Fri>
CLOSED: [2021-09-11 Sat 14:09]
**** TODO Watch videos (1.1) and take notes <2021-09-17 Fri>
:LOGBOOK:
CLOCK: [2021-09-12 Sun 00:02]--[2021-09-12 Sun 00:27] =>  0:25
CLOCK: [2021-09-11 Sat 23:32]--[2021-09-11 Sat 23:57] =>  0:25
:END:
*** CSP [100%]
**** DONE Random Password Algorithm Draft  <2021-09-13 Mon>
CLOSED: [2021-09-11 Sat 14:09]
*** Spanish [100%]
**** DONE Tarea 1 <2021-09-13 Mon>
*** Algebra 2 [100%]
**** DONE Info sheet <2021-09-11 Fri>
CLOSED: [2021-09-11 Sat 14:09]
*** MISC
**** DONE Organize needed notebooks/textbooks/planners <2021-09-13 Mon>
CLOSED: [2021-09-13 Mon 11:41]
:LOGBOOK:
CLOCK: [2021-09-12 Sun 23:04]--[2021-09-12 Sun 23:29] =>  0:25
:END:

* Week 2
** Monday
*** Algebra [100%]
**** DONE 4-48 multiples of 4 <2021-09-14 Tues>
CLOSED: [2021-09-13 Mon 18:29]
:LOGBOOK:
[2021-09-13 Mon 18:12]--[2021-09-13 Mon 18:29] =>  0:17
:END:
*** History [100%]
**** DONE Early Interactions <2021-09-14 Tues>
:LOGBOOK:
CLOCK: [2021-09-13 Mon 19:06]--[2021-09-13 Mon 19:19] =>  0:13
:END:
*** CSP [75%]
**** DONE CODIO Part 1 (into) <2021-09-14 Tue>
CLOSED: [2021-09-13 Mon 18:29]
**** DONE CODIO Part 2 <2021-09-14 Tue>
CLOSED: [2021-09-13 Mon 18:29]
**** DONE CODIO Vocab <2021-09-17 Fri>
**** DONE Random Password Algorithm Draft <2021-09-14 Tue>
CLOSED: [2021-09-13 Mon 18:29]

** Tuesday
*** Algebra [100%]
**** DONE 1-2 Properties of Real Numbers 20-50 m5 + 59-62  <2021-09-15 Wed>
CLOSED: [2021-09-15 Wed 01:28]
*** Bio [50%]
**** DONE CH-1 Guided Notes  <2021-09-15 Wed>
CLOSED: [2021-09-15 Wed 01:28]
**** DONE Great Monarch Migration  <2021-09-16 Thu>
:LOGBOOK:
CLOCK: [2021-09-14 Tue 19:27]--[2021-09-14 Tue 19:52] =>  0:25
:END:
*** Spanish [100%]
**** DONE Tarea 2 <2021-09-15 Wed>
CLOSED: [2021-09-20 Mon 13:18]
*** History [100%]
**** DONE European Interactions <2021-09-15 Wed>
CLOSED: [2021-09-15 Wed 01:28]
*** Other
**** DONE Check Rutgers Summer Application (premed) <2021-09-19 Sun>
**** DONE Enroll in Assignments Classrooom <2021-09-14 Tue>
CLOSED: [2021-09-14 Tue 17:22]
**** TODO Check Chem Olympiad info <2021-09-14 Tue>

** Wednesday
*** Bio [100%]
**** DONE Safety Scavenger hunt
DEADLINE: <2021-09-15 Wed>
*** Spanish [100%]
**** DONE Tarea 3
CLOSED: [2021-09-20 Mon 13:18] DEADLINE: <2021-09-17 Fri>
*** Algebra [100%]
**** DONE 1-3  <2021-09-15 Wed>
CLOSED: [2021-09-19 Sun 18:18]
*** History [100%]
**** DONE Louisiana Purchase
CLOSED: [2021-09-15 Wed 14:56] DEADLINE: <2021-09-15 Wed>

* Week 3 
** Monday
*** Spanish [0%]
**** DONE Tarea 6,7
DEADLINE: <2021-09-21 Tue>
*** Algebra [0%]
**** DONE 1-4  pt1
DEADLINE: <2021-09-20 Mon>
**** DONE 1-4  pt2
DEADLINE: <2021-09-21 Tue>
**** DONE ALEKS Progress Test
DEADLINE: <2021-09-23 Thu>
*** History [0%]
**** DONE Manifest Destiny
DEADLINE: <2021-09-15 Wed>

** Friday 
*** Spanish [0%]
**** DONE Tarea 10
DEADLINE: <2021-09-27 Mon>
*** History [0%]
**** TODO Manifest Destiny (survival game)
DEADLINE: <2021-09-28 Tue>
*** Biology [0%]
**** TODO Scientific Method Practice 
DEADLINE: <2021-09-28 Tue>
**** TODO Graphing Skills
DEADLINE: <2021-09-28 Tue>
*** CSP [0%]
**** DONE CODIO Practice 
DEADLINE: <2021-09-28 Tue>

* Week 4 
** Monday
*** Algebra [0%]
**** TODO Test study
DEADLINE: <2021-09-28 Tue>
*** History [0%]
**** TODO Texas
DEADLINE: <2021-09-28 Tue>
*** Bio [0%]
**** TODO Graphing
DEADLINE: <2021-09-28 Tue>
*** Chem [0%]
**** TODO Notes on Lab Safety 
DEADLINE: <2021-09-28 Tue>
**** TODO Notes 
DEADLINE: <2021-09-28 Tue>

